Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ_DA_DFP/1.0.64/edc/PIC32MZ2064DAB169.PIC
      <edc:SFRDef edc:_addr="0x1F8EA858" edc:_begin="0xec" edc:_end="0x9f4" edc:_modsrc="DOS-EIP-00160_gfx_gdc_ctlr_v1.Module" edc:_refcount="5" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="GLCDCURDATA22" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="GLCDCURDATA22" edc:nzwidth="32" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="GLCD">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="PIXEL523" edc:desc="" edc:mask="0xf" edc:name="PIXEL523" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL522" edc:desc="" edc:mask="0xf" edc:name="PIXEL522" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL521" edc:desc="" edc:mask="0xf" edc:name="PIXEL521" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL520" edc:desc="" edc:mask="0xf" edc:name="PIXEL520" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL519" edc:desc="" edc:mask="0xf" edc:name="PIXEL519" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL518" edc:desc="" edc:mask="0xf" edc:name="PIXEL518" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL517" edc:desc="" edc:mask="0xf" edc:name="PIXEL517" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL516" edc:desc="" edc:mask="0xf" edc:name="PIXEL516" edc:nzwidth="4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8EA85C" edc:_begin="0xec" edc:_end="0x9f4" edc:_modsrc="DOS-EIP-00160_gfx_gdc_ctlr_v1.Module" edc:_refcount="5" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="GLCDCURDATA23" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="GLCDCURDATA23" edc:nzwidth="32" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="GLCD">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="PIXEL531" edc:desc="" edc:mask="0xf" edc:name="PIXEL531" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL530" edc:desc="" edc:mask="0xf" edc:name="PIXEL530" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL529" edc:desc="" edc:mask="0xf" edc:name="PIXEL529" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL528" edc:desc="" edc:mask="0xf" edc:name="PIXEL528" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL527" edc:desc="" edc:mask="0xf" edc:name="PIXEL527" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL526" edc:desc="" edc:mask="0xf" edc:name="PIXEL526" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL525" edc:desc="" edc:mask="0xf" edc:name="PIXEL525" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL524" edc:desc="" edc:mask="0xf" edc:name="PIXEL524" edc:nzwidth="4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8EA860" edc:_begin="0xec" edc:_end="0x9f4" edc:_modsrc="DOS-EIP-00160_gfx_gdc_ctlr_v1.Module" edc:_refcount="5" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="GLCDCURDATA24" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="GLCDCURDATA24" edc:nzwidth="32" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="GLCD">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="PIXEL67" edc:desc="" edc:mask="0xf" edc:name="PIXEL67" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL66" edc:desc="" edc:mask="0xf" edc:name="PIXEL66" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL65" edc:desc="" edc:mask="0xf" edc:name="PIXEL65" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL64" edc:desc="" edc:mask="0xf" edc:name="PIXEL64" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL63" edc:desc="" edc:mask="0xf" edc:name="PIXEL63" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL62" edc:desc="" edc:mask="0xf" edc:name="PIXEL62" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL61" edc:desc="" edc:mask="0xf" edc:name="PIXEL61" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL60" edc:desc="" edc:mask="0xf" edc:name="PIXEL60" edc:nzwidth="4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8EA864" edc:_begin="0xec" edc:_end="0x9f4" edc:_modsrc="DOS-EIP-00160_gfx_gdc_ctlr_v1.Module" edc:_refcount="5" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="GLCDCURDATA25" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="GLCDCURDATA25" edc:nzwidth="32" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="GLCD">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="PIXEL615" edc:desc="" edc:mask="0xf" edc:name="PIXEL615" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL614" edc:desc="" edc:mask="0xf" edc:name="PIXEL614" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL613" edc:desc="" edc:mask="0xf" edc:name="PIXEL613" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL612" edc:desc="" edc:mask="0xf" edc:name="PIXEL612" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL611" edc:desc="" edc:mask="0xf" edc:name="PIXEL611" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL610" edc:desc="" edc:mask="0xf" edc:name="PIXEL610" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL69" edc:desc="" edc:mask="0xf" edc:name="PIXEL69" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL68" edc:desc="" edc:mask="0xf" edc:name="PIXEL68" edc:nzwidth="4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
