Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ_DA_DFP/1.0.64/edc/PIC32MZ2064DAB169.PIC
      <edc:SFRDef edc:_addr="0x1F8EA924" edc:_begin="0xec" edc:_end="0x9f4" edc:_modsrc="DOS-EIP-00160_gfx_gdc_ctlr_v1.Module" edc:_refcount="5" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="GLCDCURDATA73" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="GLCDCURDATA73" edc:nzwidth="32" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="GLCD">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="PIXEL1815" edc:desc="" edc:mask="0xf" edc:name="PIXEL1815" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL1814" edc:desc="" edc:mask="0xf" edc:name="PIXEL1814" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL1813" edc:desc="" edc:mask="0xf" edc:name="PIXEL1813" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL1812" edc:desc="" edc:mask="0xf" edc:name="PIXEL1812" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL1811" edc:desc="" edc:mask="0xf" edc:name="PIXEL1811" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL1810" edc:desc="" edc:mask="0xf" edc:name="PIXEL1810" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL189" edc:desc="" edc:mask="0xf" edc:name="PIXEL189" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL188" edc:desc="" edc:mask="0xf" edc:name="PIXEL188" edc:nzwidth="4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8EA928" edc:_begin="0xec" edc:_end="0x9f4" edc:_modsrc="DOS-EIP-00160_gfx_gdc_ctlr_v1.Module" edc:_refcount="5" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="GLCDCURDATA74" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="GLCDCURDATA74" edc:nzwidth="32" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="GLCD">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="PIXEL1823" edc:desc="" edc:mask="0xf" edc:name="PIXEL1823" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL1822" edc:desc="" edc:mask="0xf" edc:name="PIXEL1822" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL1821" edc:desc="" edc:mask="0xf" edc:name="PIXEL1821" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL1820" edc:desc="" edc:mask="0xf" edc:name="PIXEL1820" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL1819" edc:desc="" edc:mask="0xf" edc:name="PIXEL1819" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL1818" edc:desc="" edc:mask="0xf" edc:name="PIXEL1818" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL1817" edc:desc="" edc:mask="0xf" edc:name="PIXEL1817" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL1816" edc:desc="" edc:mask="0xf" edc:name="PIXEL1816" edc:nzwidth="4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8EA92C" edc:_begin="0xec" edc:_end="0x9f4" edc:_modsrc="DOS-EIP-00160_gfx_gdc_ctlr_v1.Module" edc:_refcount="5" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="GLCDCURDATA75" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="GLCDCURDATA75" edc:nzwidth="32" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="GLCD">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="PIXEL1831" edc:desc="" edc:mask="0xf" edc:name="PIXEL1831" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL1830" edc:desc="" edc:mask="0xf" edc:name="PIXEL1830" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL1829" edc:desc="" edc:mask="0xf" edc:name="PIXEL1829" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL1828" edc:desc="" edc:mask="0xf" edc:name="PIXEL1828" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL1827" edc:desc="" edc:mask="0xf" edc:name="PIXEL1827" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL1826" edc:desc="" edc:mask="0xf" edc:name="PIXEL1826" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL1825" edc:desc="" edc:mask="0xf" edc:name="PIXEL1825" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL1824" edc:desc="" edc:mask="0xf" edc:name="PIXEL1824" edc:nzwidth="4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8EA930" edc:_begin="0xec" edc:_end="0x9f4" edc:_modsrc="DOS-EIP-00160_gfx_gdc_ctlr_v1.Module" edc:_refcount="5" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="GLCDCURDATA76" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="GLCDCURDATA76" edc:nzwidth="32" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="GLCD">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="PIXEL197" edc:desc="" edc:mask="0xf" edc:name="PIXEL197" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL196" edc:desc="" edc:mask="0xf" edc:name="PIXEL196" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL195" edc:desc="" edc:mask="0xf" edc:name="PIXEL195" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL194" edc:desc="" edc:mask="0xf" edc:name="PIXEL194" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL193" edc:desc="" edc:mask="0xf" edc:name="PIXEL193" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL192" edc:desc="" edc:mask="0xf" edc:name="PIXEL192" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL191" edc:desc="" edc:mask="0xf" edc:name="PIXEL191" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL190" edc:desc="" edc:mask="0xf" edc:name="PIXEL190" edc:nzwidth="4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8EA934" edc:_begin="0xec" edc:_end="0x9f4" edc:_modsrc="DOS-EIP-00160_gfx_gdc_ctlr_v1.Module" edc:_refcount="5" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="GLCDCURDATA77" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="GLCDCURDATA77" edc:nzwidth="32" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="GLCD">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="PIXEL1915" edc:desc="" edc:mask="0xf" edc:name="PIXEL1915" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL1914" edc:desc="" edc:mask="0xf" edc:name="PIXEL1914" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL1913" edc:desc="" edc:mask="0xf" edc:name="PIXEL1913" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL1912" edc:desc="" edc:mask="0xf" edc:name="PIXEL1912" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL1911" edc:desc="" edc:mask="0xf" edc:name="PIXEL1911" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL1910" edc:desc="" edc:mask="0xf" edc:name="PIXEL1910" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL199" edc:desc="" edc:mask="0xf" edc:name="PIXEL199" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL198" edc:desc="" edc:mask="0xf" edc:name="PIXEL198" edc:nzwidth="4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8EA938" edc:_begin="0xec" edc:_end="0x9f4" edc:_modsrc="DOS-EIP-00160_gfx_gdc_ctlr_v1.Module" edc:_refcount="5" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="GLCDCURDATA78" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="GLCDCURDATA78" edc:nzwidth="32" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="GLCD">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="PIXEL1923" edc:desc="" edc:mask="0xf" edc:name="PIXEL1923" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL1922" edc:desc="" edc:mask="0xf" edc:name="PIXEL1922" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL1921" edc:desc="" edc:mask="0xf" edc:name="PIXEL1921" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL1920" edc:desc="" edc:mask="0xf" edc:name="PIXEL1920" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL1919" edc:desc="" edc:mask="0xf" edc:name="PIXEL1919" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL1918" edc:desc="" edc:mask="0xf" edc:name="PIXEL1918" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL1917" edc:desc="" edc:mask="0xf" edc:name="PIXEL1917" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL1916" edc:desc="" edc:mask="0xf" edc:name="PIXEL1916" edc:nzwidth="4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
